<?php
$MESS ['IPOL_DEMO_INSTALL_NAME'] = "Интеграция с demo";
$MESS ['IPOL_DEMO_INSTALL_DESCRIPTION'] = "Модуль \"Интеграция с demo\" - автоматизированные службы доставки и выгрузка заявок на доставку в demo.";

$MESS ['IPOL_DEMO_INSTALL'] = "Установка модуля \"Интеграция с demo\".";
$MESS ['IPOL_DEMO_DEL']     = "Удаление модуля \"Интеграция с demo\"...";

$MESS ['IPOL_DEMO_INSTALL_TEXT'] = "<span style='color:green'>Модуль \"Интеграция с demo\" установлен.</span></br>
Подробную информацию о подключении и работе модуля можно найти на <a href='/bitrix/admin/settings.php?lang=ru&mid=ipol.demo&mid_menu=1' target='_blank'>странице настроек модуля</a>.<br><br>
<span style='color:red'>Внимательно ознакомьтесь с разделом FAQ!</span> В особенности - с пунктом Включение функционала. Без авторизации и синхронизации модуль работать не будет!<br><br>
Модуль разработан компанией, НЕ являющейся представителем demo, мы не рассматриваем вопросы, касающиеся работы сервиса demo.<br><br>
Если Вы являетесь компанией, настраивающей модуль demo на сайте клиентов - не забудьте рассказать им про документацию и прочие пункты, освещенные на этой странице.";

$MESS ['IPOL_DEMO_DEL_TEXT'] = "<span style='color:red'>Модуль \"Интеграция с demo\" удален.</span><br>";

$MESS ['IPOL_DEMO_BADSALEVERSION'] = "Модуль предназначен для работы с Интернет-магазином версии 16 и выше. Версия модуля \"Интернет-магазин\" сайта: ";
$MESS ['IPOL_DEMO_NOCONVERTATION'] = "На данном сайте не была проведена Конвертация Интернет-магазина. Модуль предназначен для работы только с конвертированными Интернет-магазинами.";
$MESS ['IPOL_DEMO_NOCURL']         = "Для работы модуля необходима php-библиотека для работы через (<a href='https://www.php.net/manual/ru/curl.installation.php' target='_blank'>cUrl</a>).";
$MESS ['IPOL_DEMO_INSTALL_ERROR_TITLE']  = "Ошибка установки модуля \"Интеграция с demo\".";

$MESS ['IPOL_DEMO_PRESERVE_TABLES']  = "Вы можете сохранить информацию по отосланным заявкам, сохранив таблицы модуля.";